[{"id":"0","name":"0","data":{"Description":"1. The characters encounter a locked door that must be broken down to pass. What's on the other side? An abyss. Breaking the door down might cost your players a character or two.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"1","name":"1","data":{"Description":"2. The characters run into a mimic that has taken the form of a door. Turning the doorknob might cost a character their hand! Add splintered wood bits around the door to give the players a \"hint\" or just throw them off.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"10","name":"10","data":{"Description":"11. There's a simple-looking room with a locked door and a key on a pedestal. When the characters pick up the key and try to insert it into the lock, it crumbles to dust the instant it touches the keyhole. The real key is still in the room, but it's hidden somewhere—under the pedestal, under a brick in the floor, etc. The options are endless.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Locks and Keys"}},{"id":"100","name":"100","data":{"Description":"101. The group must navigate a long maze of gooey yellow sponge passages that are just large enough for one person to crawl through. The sponges start to shrink and harden if players take too long to get through.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mazes"}},{"id":"11","name":"11","data":{"Description":"12. The group reaches a big central door with 3 to 6 keyholes in it. Every key must be inserted to open it. However, each of the keys is hidden in a different part of the dungeon/facility, either in some really obvious (and therefore irritating) place, like on top of a fireplace mantle, or at the end of some daunting challenge. Whether there's anything good behind this big central door is up to you. There might just be nerve gas behind it or something equally dangerous.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Locks and Keys"}},{"id":"12","name":"12","data":{"Description":"13. The characters find a music box in some random part of the dungeon/facility. It plays a simple tune. Later (how much later is up to you), they come across an impassable door filled with holes about the size of a dagger blade. When a dagger is inserted into a hole, it makes a specific and unique tone. The door is a sound-based lock; characters must play the song from the music box to open the door.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Locks and Keys"}},{"id":"13","name":"13","data":{"Description":"14. There's an impassable door in a room with a large monolith in it. On the face of the monolith are glowing runes that are each a different color and shine their light across the face of the door. What opens the door is up to you—maybe the characters have to cover up a key rune word to open the door, or maybe they have to cover all the runes except for those that make the word, or maybe they need to create a certain color (or series of colors, as with multiple locks) in order to open the door.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Locks and Keys"}},{"id":"14","name":"14","data":{"Description":"15. The characters enter a room with a locked door and a dome of glass overhead through which they can see the sky. You can put the key somewhere really obvious to unnerve them, like on a hook next to the door. The real trick is that if they break the glass on the dome, the sky illusion also shatters, and an underground lake (previously held back by the dome) pours into the room/dungeon/facility through the hole. You can also make the door more complex to really put an edge on things and give the characters an additional reason to break the dome.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Locks and Keys"}},{"id":"15","name":"15","data":{"Description":"16. The characters find themselves in a room with a number of sealed glass insets and a locked, impassable door with the note \"In case of fire, break glass\" pinned to it. Most of the glass boxes are filled with Halon gas, which blasts out and chokes the characters exposed to it (or you could put in something worse). One of the insets opens the door (or maybe just floods the room if the door turns out to be a dud in your scheme).","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Locks and Keys"}},{"id":"16","name":"16","data":{"Description":"17. The players enter a gallery of odd-looking paintings, and both doors close and lock. If anyone pauses to look at the paintings, they feel drawn into them, like they could just step forward and be in that realm. If they try, they get sucked into the painting and must deal with the denizens thereof (fight a knight, fight a creature made of clocks, be subject to the world of \"The Scream\"). The key is in one of these painting worlds.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Locks and Keys"}},{"id":"17","name":"17","data":{"Description":"18. The room contains a locked, impassable door that, when touched, beeps and says, \"Password, please.\" Nearby is a large, onyx pyramid on a pedestal that, when touched, steals the spirit of the person who touched it and randomly injects the spirit of one of its other captives into the vacant body. One of these souls knows the password, and a number of them are violent, insane, or previous adventurers with their own agendas who won't be too keen on giving up the body they're in.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Secret Passwords"}},{"id":"18","name":"18","data":{"Description":"19. There's a room with a doorway 100 to 200 feet up. The walls are covered in tapestries. A random word has been engraved on the wall. It turns out it's the secret word for one of the tapestries that lets you treat the tapestry like a flying carpet—but it has to be removed from the anti-magic clip holding it to the wall before it will respond to the word.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Secret Passwords"}},{"id":"19","name":"19","data":{"Description":"20. The characters enter a gallery full of paintings. The door out is locked and impassable, but it seems to have a strange mesh quality to it. How do they get out? There is a letter written on the back of each of the paintings, and when they're combined (and de-jumbled) and the password is spoken aloud, the door opens. You can make it something really cheesy, like \"open sesame.\" Alternatively, you can put full words on the backs of the paintings and require the characters to put together a sentence that could even be a hint to another puzzle further on (lots of people learn by doing).","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Secret Passwords"}},{"id":"2","name":"2","data":{"Description":"3. A jelly/blob creature is squished partway through a door, with about a foot of it sticking out. It turns out that it's just the \"tip of the iceberg,\" as it were—a little piece that had to ooze out somewhere because the 1,000x1,000-foot room on the other side is already packed completely full with this thing's enormous bulk.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"20","name":"20","data":{"Description":"21. There are two chains retracted into the walls 30 feet apart. Players need to pull the two together (a feat of strength) to open the door. The door shuts quickly, so they must also find a way to connect the chains to keep the door open.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Puzzles That Require Teamwork"}},{"id":"21","name":"21","data":{"Description":"22. Two electrified handles are attached to opposite sides of a 30-foot chamber. This works like the chains in #21, except the characters need to form a conductive link to power the door and get it to open.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Puzzles That Require Teamwork"}},{"id":"22","name":"22","data":{"Description":"23. The group finds eight holes in the wall, each with a steel rod inside. One rod opens the door, while the other seven shock the character (1d4/turn to determine what happens). If a character gets shocked, it's almost impossible to get free; other characters will usually have to pry them loose.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Puzzles That Require Teamwork"}},{"id":"23","name":"23","data":{"Description":"24. The players walk into a spacious room with a large stone ring sticking out of one wall. Ghostly figures (as many as there are characters) step through the wall, one carrying a ball. They're all pretty strong, and it should really be a challenge for the players to beat them, if they do at all. You see, the winners are hauled away and sacrificed, and like Aztec ballplayers, the ghosts think this honorable death is desirable.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Puzzles That Require Teamwork"}},{"id":"24","name":"24","data":{"Description":"25. In the center of the room, there's a pedestal with a cute little rabbit sculpture on it. It does nothing, but if the characters ever all look away from it at once (like if they're leaving), it roars and shakes the room.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Puzzles That Require Teamwork"}},{"id":"25","name":"25","data":{"Description":"26. The characters have to get into a building/dungeon/installation. Make the only entrance through the hopper of an automated meat processing unit. An alarm sounds if they break it. Encourage them to get creative in their attempts to get inside without being turned into hamburger.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Puzzles That Require Teamwork"}},{"id":"26","name":"26","data":{"Description":"27. Going along with #26, maybe the only way to get into the facility is to \"become\" one of its denizens/defenders. This could be as simple as acquiring a uniform or as sacrificial as being assimilated (cybernetically) or being transformed into something otherworldly.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Puzzles That Require Teamwork"}},{"id":"27","name":"27","data":{"Description":"28. The dungeon contains an elaborate fake-out trap, like a room filled with obvious pressure plates (maybe marked, like a rune-word puzzle that has to be stepped on) or big, bold lines—that sort of thing. Either the trap was disabled, or it's there to mess with people. Add incentives/scariness by putting dangerous-looking arcing electrical things at the end by the door, ominous nozzles, broken tiles that drop into magma, etc.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Rooms With Various Traps"}},{"id":"28","name":"28","data":{"Description":"29. Anything from Indiana Jones.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Rooms With Various Traps"}},{"id":"29","name":"29","data":{"Description":"30. The characters stumble across a trap or situation that uses something from a different time/dimension. For fantasy settings, throw a couple of claymore trip mines at them. For futuristic settings, throw a steam-powered monstrosity at them, or use something involving magic (like a fireball-hurling mage).","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Rooms With Various Traps"}},{"id":"3","name":"3","data":{"Description":"4. The characters find a door with multiple knobs. The wrong knobs trigger traps.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"30","name":"30","data":{"Description":"31. The players enter a room with dirt/stone walls, like the inside of a cave. It looks totally ordinary, but there could be any number of things hidden behind the walls (large animals/monsters, mining lasers, mechanisms that push the walls together to crush what's in the room, etc.).","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Rooms With Various Traps"}},{"id":"31","name":"31","data":{"Description":"32. The party walks into a room with another, smaller room inside of it. Blood and gore have seeped out through the door of the smaller room and soaked the floor. If the players go inside, they find a sickeningly macabre scene of dismembered corpses—and then the door locks and the walls (or the ceiling) sprout knives and start to move.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Rooms With Various Traps"}},{"id":"32","name":"32","data":{"Description":"33. Stragglers in the party get caught in a trap. A good example would be an L-shaped hallway that has doors at both ends and a floor covered with about three inches of gasoline. As soon as the door in the boot of the L is opened, the opposite door sinks into the ground 5 feet, revealing a large flamethrower that toasts anything in the long part of the hallway and lights the gasoline on fire. Whoever opened the door (and anyone else with him/her) better beat feet fast and hope everyone that caught the brunt of the fire made it out okay.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Rooms With Various Traps"}},{"id":"33","name":"33","data":{"Description":"34. One room is strung with what looks like (initially) a net of thin, ghostly filaments. This turns out to be monowire strung at random intervals, making the room difficult to cross. Monowire is a thread that can slice through anything as easily as if it were passing through the air, and it's hard to see until you're right on top of it. Your players will need to be very careful.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Precarious Traps: Wires, Explosives, and More"}},{"id":"34","name":"34","data":{"Description":"35. There's a room crammed full of rotten barrels filled with decaying dynamite. There's no room to get around them—going over is the only way.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Precarious Traps: Wires, Explosives, and More"}},{"id":"35","name":"35","data":{"Description":"36. The party is faced with a room filled with sharpened bamboo poles at evenly spaced intervals, floor to ceiling. There's not really enough room to just slip by, and if one of the poles is touched, it comes alive, dealing 1d4 hp damage to the character.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Precarious Traps: Wires, Explosives, and More"}},{"id":"36","name":"36","data":{"Description":"37. The adventurers come upon a perfectly ordinary-looking floor, an empty room, etc. When they go in, the doors close and lock and the floor starts to tilt. It's on an axis, so movement tilts it in one direction or the other, and it's going to take fast reflexes for the characters to keep from slipping into the punji pit below. Unfortunately, the key that unlocks the door is fastened to a hook on the floor in such a way that it won't fall as long as the players are on the other side of the room—but if the floor tilts the other way, then the key comes loose and falls into the punji pit.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pit Traps"}},{"id":"37","name":"37","data":{"Description":"38. A 50-foot chasm full of razor-sharp blades stands between the characters and their goal or the next door.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pit Traps"}},{"id":"38","name":"38","data":{"Description":"39. The characters walk into a room with a door at the other end. The room is empty, and the door is locked, but whoever tries to open the door triggers a trap that opens the floor beneath him/her, and he/she falls into a shallow pit for minimal damage (it's mostly just surprising). If they find a way to get past the door, they find that it's just for show; it's just stone on the other side. The real door out is a trapdoor at the bottom of the pit.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pit Traps"}},{"id":"39","name":"39","data":{"Description":"40. A pit trap opens beneath a character and then seals overhead as it triggers locks on all doors in or out of the room. Inside the trap and in the room are a series of switches that do things like fill the opposite space (pit trap or room above it) with water or release sleeping gas, or fill the room with arcing lightning—fun things that can be combined to create a really hairy situation (like a flood of gasoline and later a fireball). Luckily, the switches are on/off toggles, even though the machinery is old and might take a moment or two to respond. There's also one switch that opens the doors, but both have to be turned to \"on\" to work.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pit Traps"}},{"id":"4","name":"4","data":{"Description":"5. The party faces a door that's totally barricaded over. If the characters tear down the barricades, they find whatever the door was barricaded against . . .","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"40","name":"40","data":{"Description":"41. The dungeon contains a room filled with countless levers. One unlocks and opens the opposite door. The others have various nasty effects; for example, they might release sleeping gases or laughing gases, flood the room, and cause a monster to drop from a pipe in the ceiling (there could be a complex mechanism with a whole bunch of caged monsters up there), and so on.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Lever Traps"}},{"id":"41","name":"41","data":{"Description":"42. The room features eight levers in sockets that must all be turned at once.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Lever Traps"}},{"id":"42","name":"42","data":{"Description":"43. The characters enter a room with eight pools of water and eight flush levers. Pressure plates in the floor allow the levers to be used. Seven of them flush the characters into a pit full of water and zombies. One opens the door.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Lever Traps"}},{"id":"43","name":"43","data":{"Description":"44. A curving downward staircase dominates the room. Pressure plates on the staircase trigger an automated crossbow/weapon at the bottom, making it seem like someone's down there. However, it's just a statue that's wired to shoot bolts/bullets. The door to the next room is beside the statue.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pressure Plate Traps"}},{"id":"44","name":"44","data":{"Description":"45. The group finds a room with yellow lines that border the walls and break for spaces at even intervals 2–3 times. Where the lines break, there's a pressure-sensitive trap that spins the entire section of the hallway to the left and ejects the characters down into a pit of some kind or another. Add punjis, zombies, monsters, etc., to receive them when they fall, if appropriate.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pressure Plate Traps"}},{"id":"45","name":"45","data":{"Description":"46. There's a room full of statues (eight or so) holding corked vials. Setting off hidden pressure plates causes the statues to drop the vials, releasing nerve gas. The door handle is a knife blade.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pressure Plate Traps"}},{"id":"46","name":"46","data":{"Description":"47. The party discovers a room with a zodiac spread across the floor. Close observation shows that it has a thirteenth symbol; closer observation reveals it's an unrelated symbol (get creative—make it the Ford symbol or something), and even closer inspection reveals that it's a pressure plate.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pressure Plate Traps"}},{"id":"47","name":"47","data":{"Description":"48. There's a device (or a room housing a device) that subsonically triggers the pleasure centers of the brain in all who are exposed to it. It could be triggered by a pressure plate in the center of the room. The characters might get caught permanently in the center of the room, unwilling (or unable) to move simply because they're experiencing something akin to an endless, massive orgasm. Sure, they'll die of starvation eventually, or maybe you could have some kind of creature come along and nibble on them first.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Pressure Plate Traps"}},{"id":"48","name":"48","data":{"Description":"49. The room is filled with freezing particles that stick to the skin and slow the characters down significantly. Add monsters or other challenges to taste.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Environmental Challenges"}},{"id":"49","name":"49","data":{"Description":"50. The players step into a room with gravity pulling four ways (up, down, left, right). Each \"wall\" is a 5-foot-deep pit of molten gold.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Environmental Challenges"}},{"id":"5","name":"5","data":{"Description":"6. The players find themselves face-to-face with a giant, steel double door covered in a series of dark, symmetrically aligned holes. Opening the door triggers the forty-at-once wheeled arrow battery on the other side to fire its payload through the door.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"50","name":"50","data":{"Description":"51. The group must cross a room filled with a hazy blue/red/green mist. It could just be mist or an illusion, or it could be vampiric, leaching blood (hp), stats, or even artifact/item powers. Or maybe it makes all gunpowder it touches non-functional—there's a lot of room for creativity here.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Environmental Challenges"}},{"id":"51","name":"51","data":{"Description":"52. The characters walk into a room that's filled with a misty red haze, and there's a noticeably odd iron tang to the air. You can include things hiding in the mist, but the presence of the mist alone should be enough to mess with the characters. A room or two down the line, the doors close (they don't have to lock), and with a crackle and hum of electricity, a hypersensitive electromagnet that covers the whole ceiling comes alive. This will grab weapons, armor, and anything magnetic—including items that weren't properly cleaned after the red mist room. Next, the room begins to fill with water (or something else—it depends on how nasty you want to be). There's a drain on the other side of either door, though, so if they can get free from the magnet before they drown, there's still hope of escape.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Environmental Challenges"}},{"id":"52","name":"52","data":{"Description":"53. The dungeon features a room with an unusual light source (like a torch in a tube in the floor) with a lot of shadows. One or more of those shadows are living—and hungry.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Light and Darkness"}},{"id":"53","name":"53","data":{"Description":"54. The characters walk into a hallway filled with rushing air enchanted to extinguish any light sources, so they have to stumble around in the dark. This leads to a large room that is likewise enchanted, but if they unwittingly step on a pressure plate in this room, it disables the enchantment and triggers a cache of 50 coins to drop from the ceiling. Each coin is enchanted with a very bright continual light spell. The combined light from the players' light sources and the coins is blinding, especially combined with the fact that the entire room has been covered in mirrors. Add monsters that leap out and jump on blinded players as you see fit.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Light and Darkness"}},{"id":"54","name":"54","data":{"Description":"55. The players enter an empty room with a slowly strobing light (spell-based or technology, whatever works in your campaign). What they don't see is the monster/ninja/assassin stuck to the ceiling above them.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Light and Darkness"}},{"id":"55","name":"55","data":{"Description":"56. There's a strobe-lit hall of warped mirrors. Every time the light flashes, something grotesque appears. Add doppelgängers to amp up the fun if you wish.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Light and Darkness"}},{"id":"56","name":"56","data":{"Description":"57. A room has a hyper-aging field installed in it that turns one minute into one year. Inside the field, the room has given way to a lush forest with flowers that bloom, turn to fruit, and drop all in the space of a minute. There's a door on the other side.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Time-Based Puzzles"}},{"id":"57","name":"57","data":{"Description":"58. The characters reach a normal-looking room with some decent furniture in it (a couch, a coffee table, several easy chairs, a bookcase, a clock, etc.). There's also a water fountain and a bowl of fruit on the table. When the group goes inside, the door locks behind them and becomes impassable (as the other door already is). How do they get out? The clock on the wall is open and magical; turning it advances time (or reverses it) in the room, but only on the objects in the room (and the doors). They can reverse it to reopen the first door, or they can push it forward until the doors rot away and fall off the hinges. (Or open automatically—something like that.)","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Time-Based Puzzles"}},{"id":"58","name":"58","data":{"Description":"59. An old man appears in a flash of light and offers to sell things to the characters. Does he have a motive?","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mysterious and Dangerous Encounters"}},{"id":"59","name":"59","data":{"Description":"60. A powerful wizard creates a cavernous sinkhole beneath the city the players are in.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mysterious and Dangerous Encounters"}},{"id":"6","name":"6","data":{"Description":"7. The players find an important door they have to go through, but a massive pillar has fallen directly into it, jamming it and blocking the way.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"60","name":"60","data":{"Description":"61. A horde of ghost pirates comes through the walls and attacks the players.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mysterious and Dangerous Encounters"}},{"id":"61","name":"61","data":{"Description":"62. The players open a flimsy-looking door and find themselves face-to-face with a massive, arena-style room packed with an audience of 10,000 to 20,000 hungry zombies.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mysterious and Dangerous Encounters"}},{"id":"62","name":"62","data":{"Description":"63. The party enters a room full of about 30 gorillas that all look up when the door is opened. Watch your players freak out. Gorillas are actually really gentle; they don't care what the players do, as long as they don't hurt any of them. If they do, the gorillas just run away or attempt to defend themselves.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mysterious and Dangerous Encounters"}},{"id":"63","name":"63","data":{"Description":"64. The room is filled with corpses in various states of decay. They can either lay in wait for the moment to rise up and attack, or maybe they really are just corpses. Or you could get creative and have them rise up magically but be nothing more than a puppeteer's toys.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mysterious and Dangerous Encounters"}},{"id":"64","name":"64","data":{"Description":"65. There's a really creepy room with really creepy things the players can explore, play with, or even take with them. Consider your living room, and then imagine if every piece of furniture was made from bone and poorly stretched human hide—that kind of thing.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mysterious and Dangerous Encounters"}},{"id":"65","name":"65","data":{"Description":"66. While the characters are in a town buying supplies, looking for work, or relaxing, a wizard in that same town unwittingly opens a singularity bubble in his tower, making the town the focal point of a baby black hole that the whole world is slowly imploding into. (This is a great start for a new quest.)","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mysterious and Dangerous Encounters"}},{"id":"66","name":"66","data":{"Description":"67. The group sees a long passage of murky, depthless water ahead. Two boats are tied up at the entrance: one that looks rickety and has a little water in the bottom, and one that looks new and really watertight, with gilded edges. It turns out the \"new\" boat is actually an illusion, and it disappears in a puff of smoke about halfway through the passage. Add water encounters, tentacles, piranhas, kelpies, and the like to taste.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Illusions and Hallucinations"}},{"id":"67","name":"67","data":{"Description":"68. The characters face an illusory wall of fire, ice, water, and/or lightning.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Illusions and Hallucinations"}},{"id":"68","name":"68","data":{"Description":"69. There's a circular room with a fountain in the center of it. It looks like the floor is covered with about a foot of water, and gold coins are spread across the bottom. This turns out to be an illusion: The water is actually more like ten feet deep with something scary and hungry at the bottom (like tentacles and a big toothy mouth, another ooze, or a horde of water-bloated zombies, etc.).","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Illusions and Hallucinations"}},{"id":"69","name":"69","data":{"Description":"70. The group must walk through a long hallway filled with misters. In the center is a pedestal that does nothing, but it looks like it does something. The trick is in the misters: They're dispensing liquid LSD, and it starts to take effect before too long. The longer the exposure, the more vivid the hallucinations become.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Illusions and Hallucinations"}},{"id":"7","name":"7","data":{"Description":"8. A living door with a face greets the characters as they come into the room. He doesn't want to let them through, but if they persist, then he says he requires a living sacrifice. If they try to get through anyway, he chooses one of them at random and traps them in a constricting magic jar. He can be persuaded to let his target go, but only at a steeper price. If they pay the price, he lets them through.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"70","name":"70","data":{"Description":"71. The players reach a large field of flowers and fruit and peace. The fruit has a sleep toxin. It's all an illusion, and the \"flush\" lever can be found with a little searching. Turns out all the \"food\" was actually sewage.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Illusions and Hallucinations"}},{"id":"71","name":"71","data":{"Description":"72. The room has an odd golden haze hanging in it. In the center of the room is a squalling baby on a dais. If the players scoop it up, it smiles and laughs and then turns into a wad of angry mutant flesh with talons that tries to latch onto faces and whatnot. At that moment, the rest of the room turns into something living, like the inside of a stomach.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Encounters With Illusory People"}},{"id":"72","name":"72","data":{"Description":"73. The players walk into a room just in time to see a man with a jackal's head (Anubis) confront a man who looks like another adventurer. He says, \"Only he whose heart is so pure that it weighs less than a feather may pass to the other side. Show me your chest so that I might judge.\" The adventurer does so, and Anubis reaches out and removes his heart, then weighs it. Finding it weighs more than a feather, he hucks the heart into the mouth of a nearby crocodile, and the adventurer dies on the spot. Anubis then looks at the characters and repeats his first line. In truth, the whole thing is an illusion, but the shock of having one's heart devoured as such is enough to kill a character.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Encounters With Illusory People"}},{"id":"73","name":"73","data":{"Description":"74. A wise-looking (or famous) sage/messiah waits for the characters in a room with no visible doors. He/she greets them and speaks with them. If asked where to go or how to proceed, the sage tells them that only in death can one see and go through the door that lies in this room. It is locked to all else. Attempts to find the door should fail. The sage will continue to \"help\" them accept that they have to die and will gladly kill them if they wish (absorbing their spirits as payment and keeping them from passing to the next world so they are just dead and gone forever). The only way through is to confront the sage, who, after the players start getting aggressive, turns into some kind of hideous monster that turns out to be a real test of the characters' strengths. Killing the monster reveals the door and unlocks it.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Encounters With Illusory People"}},{"id":"74","name":"74","data":{"Description":"75. The room is full of bubbles that show the players' nightmares, bad memories, and fears to them.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mental and Fear-Based Challenges"}},{"id":"75","name":"75","data":{"Description":"76. The room has a ragged, bottomless-looking hole in the center. Closer inspection reveals massive toothmarks on the edge of the hole and a deep breathing sound coming from far down in the bottom. This is a great way to scare your characters. Add a giant man-eating wyrm for a little more spice.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mental and Fear-Based Challenges"}},{"id":"76","name":"76","data":{"Description":"77. A single mirror sits at the end of the room. Looking into it reveals a face that jumps out of the mirror and screams. If a character overcomes their fear and screams back, they get grabbed and pulled through to the other side.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mental and Fear-Based Challenges"}},{"id":"77","name":"77","data":{"Description":"78. The party enters a room with a man hanging at the far end, his wrists and ankles in shackles, chained to the wall and over the door. Walking closer to him tightens the chains (like a rack). He screams in pain and begs for mercy every time they tighten. It could be an illusion—you decide how much to mess with your characters' sense of right and wrong.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Morality Challenges"}},{"id":"78","name":"78","data":{"Description":"79. The adventurers reach a circular raised platform. Light comes down upon it. Only the penitent man will pass.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Morality Challenges"}},{"id":"79","name":"79","data":{"Description":"80. The characters enter a room, and suddenly steel walls fall from the ceiling and separate them, creating individual hallways from which there appears to be no escape. The walls should be soundproof, too. As soon as the character looks away or gets desperate, someone appears whom he/she loves or really trusts, and this someone tries to keep them there by any means necessary. Add rising water or heat or other deadly panic-inducers for extra fun. How do the characters get out? They must work up the nerve to attack and kill the illusory person.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Morality Challenges"}},{"id":"8","name":"8","data":{"Description":"9. The players are stuck at a large door that won't budge. On either side of the door, two to a side, are four long, flexible copper wires that are rolled up. Also in the room are a number of fruit trees, including oranges and grapes, and a number of clay pots. The trick to get through is to make four primitive batteries to power the door by filling pots with acidic fruit juice and putting the copper wires in them.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Door Puzzles and Traps"}},{"id":"80","name":"80","data":{"Description":"81. The party finds a statue of a big, buff man with a grin on his face. He holds his bicep with one hand and stretches out his arm, with his other hand clenched halfway between open and a fist. The players must arm-wrestle the statue to get through.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Statue Puzzles"}},{"id":"81","name":"81","data":{"Description":"82. There's a long gravel corridor with a heavy statue of a laughing guy in football gear holding a rope at one end and a car trunk at the other. The characters must drag the statue through the gravel to the car trunk and connect them to pass.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Statue Puzzles"}},{"id":"82","name":"82","data":{"Description":"83. The group comes upon a table with two chairs and a statue of a smiling, one-armed hick that comes alive and starts pouring drinks. Characters must outdrink the hick.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Statue Puzzles"}},{"id":"83","name":"83","data":{"Description":"84. The characters reach a tricky junction: In one room is a trap/challenge and a locked, unbreakable door but no key. In the other is the key, but it's set on a pedestal in the middle of a cluster of ominous-looking statues of armed warriors who are all staring at it. Whether or not the statues come to life when the key is taken is up to you.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Statue Puzzles"}},{"id":"84","name":"84","data":{"Description":"85. The room features a pool of bubbling sewage with a pipe under it leading to a toilet bowl that the players must climb up through.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Water-Based Puzzles and Traps"}},{"id":"85","name":"85","data":{"Description":"86. A massive, tsunami-style tidal wave immediately rises up to crush the characters. They can choose to run away in fear or face it. It turns out to be an illusion.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Water-Based Puzzles and Traps"}},{"id":"86","name":"86","data":{"Description":"87. This one's great for the room right after #86: A real tsunami-style tidal wave rises up to crush the characters.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Water-Based Puzzles and Traps"}},{"id":"87","name":"87","data":{"Description":"88. There's a room filled with water and fish that are contained within the room by magic or technology. Whatever it is, you can walk through it, and you're going to have to if you want to see what's on the other side. The water is dark and a little cloudy, but there's just some harmless-looking fish visible, so it can't be that bad ... until you get about halfway in and there's a shark or a larger room with a bigger shark, or something like that.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Water-Based Puzzles and Traps"}},{"id":"88","name":"88","data":{"Description":"89. The characters walk down a long, windy passage with grates spaced at even intervals along the floor. A closer look will reveal unnaturally smooth walls, their surface almost glassy. Before the characters get in too far, the door they came through slams shut, opening a wide pipe that starts filling the room with some liquid as all the floor grates seal. The liquid could be simple water, or, if you're feeling particularly nasty, make it something more dangerous, like sulfuric acid. You can also make the door at the other end of the tunnel a puzzle to open, too, for added fun and panicking.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Water-Based Puzzles and Traps"}},{"id":"89","name":"89","data":{"Description":"90. When the characters enter the room, the door closes behind them and becomes impassable. There are no other visible doors, and the room is starting to flood. What's the trick to getting out? There's a concealed trapdoor on the ceiling that can only be reached by swimming as the room fills.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Water-Based Puzzles and Traps"}},{"id":"9","name":"9","data":{"Description":"10. There's a door with a large, unusual keyhole. The room is filled with keys and a handful of random objects. All the keys but the proper one are coated in poison (sleep poison, withering, etc.—it's up to you), and the proper one turns out to be something really random like a wine bottle (breakable, muahahaha) or a dildo (who's gonna want to touch that?).","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Locks and Keys"}},{"id":"90","name":"90","data":{"Description":"91. The players encounter a room with a mud floor and a door at the opposite end. This floor is sticky, like quicksand, and it's about 12 feet deep.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Viscous Fluids: Mud, Ooze, Quicksand, and More"}},{"id":"91","name":"91","data":{"Description":"92. There's a room with a mud floor. The character who swims to the bottom and finds the tunnel to the next room escapes.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Viscous Fluids: Mud, Ooze, Quicksand, and More"}},{"id":"92","name":"92","data":{"Description":"93. The room features a circular, man-sized opening/door sweeping down into the floor. It's filled with something sticky and viscous, like honey or molasses. Beyond the floor (where it can't be seen except by diving in), it narrows steadily down to a fist-sized opening with a lever at maximum arm's reach that opens a secret door (leading to the next room), but it's back beyond the mouth of the pipe.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Viscous Fluids: Mud, Ooze, Quicksand, and More"}},{"id":"93","name":"93","data":{"Description":"94. The dungeon contains a large, rectangular, Olympic-sized pool that's about 12 feet deep, with the bottom covered in rusty-looking armor and items, etc. Turns out there's a translucent jelly blob thing down there with the gear inside it, and it completely covers the floor up to about two feet from the bottom. It's hungry, too, so the characters better watch out!","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Viscous Fluids: Mud, Ooze, Quicksand, and More"}},{"id":"94","name":"94","data":{"Description":"95. A 200-foot steel wall blocks the way. The handholds are razorblades of sharpness.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Walls and Other Obstacles"}},{"id":"95","name":"95","data":{"Description":"96. The party reaches a wall of acoustic force that blasts the ears and can only be passed through sheer force of will. It makes characters temporarily deaf.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Walls and Other Obstacles"}},{"id":"96","name":"96","data":{"Description":"97. There's a thick wall of ice blocking the passage that shoots out 10-inch blades when touched (1d6 to resolve).","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Walls and Other Obstacles"}},{"id":"97","name":"97","data":{"Description":"98. The players come upon a room full of bouncing basketballs that they have trouble wading through. In the middle somewhere, balls start shooting at the characters at random, hitting them in \"stun\"-type locations, like the face and groin.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Walls and Other Obstacles"}},{"id":"98","name":"98","data":{"Description":"99. The room is filled with an odd network of pipes that makes it difficult to move through. Closer inspection reveals that some of the pipes are made out of substances other than metal (like skin or wood), and the pipes react to being touched. If the room feels threatened in any way, or if it thinks it can kill whoever's in it, it will burst pipes near that person, spraying them with steam, ground glass, acid, or any number of other things the DM can come up with. Dead characters and abandoned objects left in the room are absorbed to make new pipes.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Walls and Other Obstacles"}},{"id":"99","name":"99","data":{"Description":"100. The party discovers a hexagonal room with no obvious way out and an arrow drawn on the floor facing a wall. There are secret doors on every wall, each leading to another similar hexagonal room with another random arrow. (You might want to map this out so you don't get lost, even if the players do.) This makes a great maze.","Disclaimer":"From the following resource: https://hobbylark.com/tabletop-gaming/101rpgtrapsandchallenges","Type":"Mazes"}}]